if Gem.win_platform?
	Encoding.default_external = Encoding.find(Encoding.locale_charmap)
	Encoding.default_internal = __ENCODING__

	[STDIN, STDOUT].each do |io|
		io.set_encoding(Encoding.default_external, Encoding.default_internal)
	end
end

answers = [
	# Положительные
	"БЕССПОРНО",
	"ПРЕДРЕШЕНО",
	"НИКАКИХ СОМНЕНИЙ",
	"ОПРЕДЕЛЕННО ДА",
	"МОЖЕШЬ БЫТЬ УВЕРЕН В ЭТОМ",
	# Нейтрально положительные
	"МНЕ КАЖЕТСЯ — «ДА»",
	"ВЕРОЯТНЕЕ ВСЕГО",
	"ХОРОШИЕ ПЕРСПЕКТИВЫ",
	"ЗНАКИ ГОВОРЯТ — «ДА»",
	"ДА",
	# Нейтральные
	"ПОКА НЕ ЯСНО, ПОПРОБУЙ СНОВА",
	"СПРОСИ ПОЗЖЕ",
	"ЛУЧШЕ НЕ РАССКАЗЫВАТЬ",
	"СЕЙЧАС НЕЛЬЗЯ ПРЕДСКАЗАТЬ",
	"СКОНЦЕНТРИРУЙСЯ И СПРОСИ ОПЯТЬ",
	# Отрицательные
	"ДАЖЕ НЕ ДУМАЙ",
	"МОЙ ОТВЕТ — «НЕТ»",
	"ПО МОИМ ДАННЫМ — «НЕТ»",
	"ПЕРСПЕКТИВЫ НЕ ОЧЕНЬ ХОРОШИЕ",
	"ВЕСЬМА СОМНИТЕЛЬНО"
]

hi = [
	"Привет, дорогой друг. Отвечаю на твой вопрос...",
	"Кто вопрошает, тот ответ свой получает...",
	"Здравствуй, смертный. Сегодня для тебя такой ответ..."
]

puts hi.sample
sleep 2
puts ""
puts answers.sample